{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5   {1, 6, 7, 11, 15}\n",
      "8   {6, 10, 14, 15, 16, 19, 20}\n"
     ]
    }
   ],
   "source": [
    "'''Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с\n",
    "повторениями). Выдать без повторений в порядке возрастания все те числа, которые\n",
    "встречаются в обоих наборах.\n",
    "Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во\n",
    "элементов второго множества. Затем пользователь вводит сами элементы множеств\n",
    "'''\n",
    "n = int (input ('Количество элементов в множестве 1 = ' ))\n",
    "m = int (input ('Количество элементов в множестве 2 = ' ))\n",
    "sN = set ()\n",
    "sM = set ()\n",
    "for _ in range (n):\n",
    "    from random import randint\n",
    "    k = randint (1,20)\n",
    "    sN.add (k)\n",
    "print (n, ' ', sN)  \n",
    "for _ in range (m):\n",
    "    from random import randint\n",
    "    k = randint (1,20)\n",
    "    sM.add (k)\n",
    "print (m, ' ', sM)  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Количество ягод на кустах [2, 14, 16, 8, 18, 2, 10, 19, 11, 18]\n",
      "Максимальное количество ягод с трех кустов =  48\n"
     ]
    }
   ],
   "source": [
    "'''Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, \n",
    "причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. \n",
    "Всего на грядке растет N кустов. Эти кусты обладают разной урожайностью, поэтому ко времени сбора \n",
    "на них выросло различное число ягод – на i-ом кусте выросло ai ягод.\n",
    "В этом фермерском хозяйстве внедрена система автоматического сбора черники.\n",
    "Эта система состоит из управляющего модуля и нескольких собирающих модулей.\n",
    "Собирающий модуль за один заход, находясь непосредственно перед некоторым\n",
    "кустом, собирает ягоды с этого куста и с двух соседних с ним.\n",
    "Напишите программу для нахождения максимального числа ягод, которое может\n",
    "собрать за один заход собирающий модуль, находясь перед некоторым кустом\n",
    "заданной во входном файле грядки. \n",
    "'''\n",
    "Nbush = 10\n",
    "Kberry = list ()\n",
    "for i in range (Nbush):\n",
    "    from random import randint\n",
    "    Kberry.append (randint(1,20))\n",
    "print ('Количество ягод на кустах', Kberry)\n",
    "Kberry += Kberry[:2]\n",
    "#print(Kberry)  \n",
    "max3 = 1\n",
    "for i in range (Nbush - 2):\n",
    "    sum = Kberry[i] + Kberry [i+1] + Kberry [i+2]\n",
    "    #print(sum) \n",
    "    if max3 < sum:\n",
    "        max3 = sum\n",
    "print ('Максимальное количество ягод с трех кустов = ', max3)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.6"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
